In [1]:
import numpy as np 
import pandas as pd

In [2]:

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df=pd.DataFrame(dict1)

# display top 3 rows of the dataset

In [3]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# check last 3 rows of the dataset

In [4]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# find shape of our dataset

In [5]:
df.shape

(7, 3)

# get information about our dataset like total no rows , totl no of columns , datatypes of each column and memory requirement

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# check null values in the dataset

In [7]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [9]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df.isnull().sum(axis=1) 
# to get zeroes of each rows rather than for columns

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# get overall stats about the dataframe

In [11]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

# find unique values from the gender column

In [13]:
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

# find the number of unique values from the gender column

In [14]:
df.Gender.nunique()

2

# display count of unique values in gender column  (imp)

In [23]:
df.Gender.value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# find total number of students having marks between 90 to 100

In [27]:
df['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [32]:
ans=(df['Marks']>=90) & (df['Marks']<=100) #not use and use & 
ans

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [34]:
df[ans]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [35]:
len(df[ans])

4

## another way

In [38]:
sum(df['Marks'].between(90,100))

4

# find av. marks

In [39]:
df.Marks.mean()

92.14285714285714

# apply method

In [44]:
def marks(x):
    return x//2

In [45]:
df['half marks']=df.Marks.apply(marks)

In [46]:
df

      Name  Marks  Gender  half marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

# map function

In [48]:
df['normal']=df.Gender.map({'Male':1,'Female':0})

# drop the column

In [51]:
df.drop('normal',axis=1)
df

      Name  Marks  Gender  half marks  normal
0  Priyang     98    Male          49       1
1   Aadhya     89  Female          44       0
2   Krisha     99  Female          49       0
3   Vedant     87    Male          43       1
4   Parshv     90    Male          45       1
5   Mittal     83  Female          41       0
6  Archana     99  Female          49       0

In [52]:
# for multiple columns 
df.drop(['half marks','normal'],axis=1,inplace=True)

In [53]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# sort the values

In [58]:
df.sort_values(by=['Marks','Name']) #default axis=0

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
6  Archana     99  Female
2   Krisha     99  Female

# display the marks and name of the female students

In [61]:
val=df.Gender=='Female'
val

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [64]:
df[val]['Name']

1     Aadhya
2     Krisha
5     Mittal
6    Archana
Name: Name, dtype: object

In [68]:
df[df['Gender'].isin(['Female'])] #important

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female